app/controllers/alerts_controller.rb

  def index
    @alert = Alert.where(monitoring_point_id: params[:monitoring_point_id])
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."monitoring_point_id" = $1  [["monitoring_point_id", 1]]

  def create
    @alert = Alert.new(alert_params)
    if @alert.save
---
INSERT INTO "alerts" ("title", "monitoring_point_id", "max_value", "created_at", "updated_at", "alert_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"