app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jian_rodrigues@hotmail.com"], ["LIMIT", 1]]
---
  def login
    adm = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."authentication_token" = $2 LIMIT $3  [["email", "jian15@teste.com"], ["authentication_token", "zyyxPZBxj2Kyq__bGvyU"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL AND "users"."authentication_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def require_authentication!
    @admin = User.find_by(email: request.headers['email'],authentication_token: request.headers['token'])
    render json:  { errors: "Não autorizado"  }, status: 403 unless @admin.present?