app/controllers/locales_controller.rb

SELECT "locales".* FROM "locales"
---
  def index
    @locales = Locale.all

SELECT "monitoring_points".* FROM "monitoring_points" WHERE "monitoring_points"."locale_id" = $1  [["locale_id", 2]]
---
  def show_monitoring_points
    render json: @locale.as_json.merge(monitoring_points: @locale.monitoring_points.map(&:monitoring_logs_response))

INSERT INTO "locales" ("title", "address", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Casa 21 "], ["address", "Dr pedrosa 22"], ["description", "Casa 21 "], ["created_at", "2018-11-25 23:57:50.245035"], ["updated_at", "2018-11-25 23:57:50.245035"], ["user_id", 8]]
---
  def create
    @locale = Locale.new(locale_params)
    if @locale.save

SELECT  "locales".* FROM "locales" WHERE "locales"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_locale
    @locale = Locale.find(params[:id] || params[:locale_id])