app/controllers/locales_controller.rb

  def set_locale
    @locale = Locale.find(params[:id])
---
SELECT  "locales".* FROM "locales" WHERE "locales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]