app/controllers/monitoring_logs_controller.rb

  def index
    @monitoring_log = MonitoringLog.where(monitoring_point_id: params[:monitoring_point_id])
    render json: @monitoring_log.map(&:as_api_response).to_json
---
SELECT "monitoring_logs".* FROM "monitoring_logs" WHERE "monitoring_logs"."monitoring_point_id" = $1  [["monitoring_point_id", 1]]

  def create
    @monitoring_log = MonitoringLog.new(monitoring_log_params)
    if @monitoring_log.save
---
INSERT INTO "monitoring_logs" ("monitoring_point_id", "point_value", "created_at", "updated_at", "current_value") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["monitoring_point_id", 2], ["point_value", 100.5], ["created_at", "2018-11-16 23:05:09.430525"], ["updated_at", "2018-11-16 23:05:09.430525"], ["current_value", 250.0]]