app/controllers/monitoring_points_controller.rb

  def index
    @monitoring_point = MonitoringPoint.all
---
SELECT "monitoring_points".* FROM "monitoring_points"

  def create
    @monitoring_point = MonitoringPoint.new(monitoring_point_params)
    if @monitoring_point.save
---
INSERT INTO "monitoring_points" ("title", "description", "locale_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Banheiro 1 "], ["description", "Banheiro 1"], ["locale_id", 2], ["created_at", "2018-11-11 02:36:19.305328"], ["updated_at", "2018-11-11 02:36:19.305328"]]

  def set_locale
    @monitoring_point = MonitoringPoint.find(params[:id])
---
SELECT  "monitoring_points".* FROM "monitoring_points" WHERE "monitoring_points"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]