app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    byebug
    @user = User.all

INSERT INTO "users" ("email", "encrypted_password", "name", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create_user
    @user = User.new(user_params)
    if @user.save