app/models/monitoring_log.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."monitoring_point_id" = $1  [["monitoring_point_id", 12]]
SELECT SUM("monitoring_logs"."point_value") FROM "monitoring_logs" WHERE "monitoring_logs"."monitoring_point_id" = $1  [["monitoring_point_id", 12]]
INSERT INTO "alert_messages" ("alert_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["alert_id", 2], ["created_at", "2018-12-03 02:33:45.830933"], ["updated_at", "2018-12-03 02:33:45.830933"]]
---
    def create_alert
      monitoring_point.alerts.each do |alert|
        byebug
        total_value = monitoring_point.monitoring_logs.sum(:point_value)
        AlertMessage.create(alert: alert) if total_value > alert.max_value