app/models/monitoring_point.rb

  def self.show_charts(id_1, id_2)
    monitoring_point_1 = MonitoringPoint.find(id_1)
    monitoring_point_2 = MonitoringPoint.find(id_2)
    array_to_return = []
    (1..7).each do |i|
      response = {}
      response['name'] = select_day_of_week(i)
      response['amt'] = 2000
      day = Date.today.beginning_of_week - 1.week + i.days
      response[monitoring_point_1.title] = monitoring_point_1.monitoring_logs.where(created_at: day.beginning_of_day..day.end_of_day)
      .sum(:point_value)
      p Date.today.beginning_of_week - 1.week + i-1.days
      response[monitoring_point_2.title] = monitoring_point_2.monitoring_logs.where(created_at: day.beginning_of_day..day.end_of_day)
            .sum(:point_value)
---
SELECT  "monitoring_points".* FROM "monitoring_points" WHERE "monitoring_points"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "monitoring_points".* FROM "monitoring_points" WHERE "monitoring_points"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT SUM("monitoring_logs"."point_value") FROM "monitoring_logs" WHERE "monitoring_logs"."monitoring_point_id" = $1 AND "monitoring_logs"."created_at" BETWEEN $2 AND $3  [["monitoring_point_id", 12], ["created_at", "2018-11-19 00:00:00"], ["created_at", "2018-11-19 23:59:59.999999"]]
SELECT SUM("monitoring_logs"."point_value") FROM "monitoring_logs" WHERE "monitoring_logs"."monitoring_point_id" = $1 AND "monitoring_logs"."created_at" BETWEEN $2 AND $3  [["monitoring_point_id", 13], ["created_at", "2018-11-19 00:00:00"], ["created_at", "2018-11-19 23:59:59.999999"]]